Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 武殿只为武者服务，每一座武殿内都有聚灵阵，在里面修炼能加速，这里有海量的各阶武技，神兵，丹药，等宝物。这里有重力房，有陪练，机关房等等各种辅助武者提升实力的好地方，只要有紫金，这里就是武者的天堂。
en_us: 聚灵阵The Martial Arts Hall only worked in the service of martial artists. The interior of every Martial Arts Hall contained a spirit concentration spell, allowing anyone cultivating spiritual power inside to increase in speed. There was a huge volume of martial arts techniques, spiritual warriors, elixir pills and a wide variety of other treasures. There were good facilities inside including a Heavy Strengthening Room, provision of sparring partners and a Mechanism Training Room - all sorts of facilities that could help martial artists increase their power. So long as one had purple gold to spend, this place was effectively a heaven for any martial artist.

source: 武殿可不是江家的武堂，那是天羽城内一个很神秘的地方，据说在里面打坐闭关修炼速度能快上两倍，而且里面还有重力室，练功房，专业陪练之类的，是武者修炼的天堂。江逸很早就听说过这武殿，却只能远远的看一眼，因为要想进入武殿修炼，入门费用都需要一两紫金……、
en_us: The martial arts hall was not the main training court of the Jiang Yi, but rather a mysterious location within Skyplume City. According to legend, anyone who meditated there in seclusion could increase their essence force refining speed by up to two times. Additionally, there were many other facilities inside like a strength room, a technique-practicing room, and professional trainers who could facilitate and follow in one's training. In short, it was a martial artists' paradise. Jiang Yi had heard about this martial arts hall ages ago, but he could only eye it from afar, as the entrance fee for even entering the martial arts hall cost a tael of purple gold...

source: 武殿外还在招陪练，不过围观的人少了，江逸刚刚靠近侧门，那高大黑甲护卫立即热情的招呼他道：“嘿，小哥，你可来了，杨管事可是问了你几次啊。”
en_us: The personnel at the Martial Arts Hall were still publicising their call for more sparring partners outside the building, but the surrounding spectators have become fewer in number. Jiang Yi had just walked close to the side door when that big tall guard clad in black armour immediately called out to him and said warmly, "Hey, little man, you're finally here! Manager Yang had asked for you several times."

source: 武殿大门紧闭，侧门倒是打开的，不过有两名黑甲护卫守卫，江逸目光顺着众人定格在武殿外的一张告示上。
en_us: The main doors of the Martial Arts Hall were sealed shut. The side door was indeed open, but there were two guards clad in black armor protecting the entrance. Jiang Yi's gaze followed the crowd and eventually fixed itself on a notice placed outside the Martial Arts Hall.

source: 武殿并不是一股势力，也从不参与大陆纷争，严格来说它应该是天星大陆最大的商号！不过它服务的对象是高级武者和富贵人家的少爷小姐，没有紫府境的实力要想进入武殿，入门必须交纳一两紫金。
en_us: The Martial Arts Hall was not an organized faction. It had no power concentrated in it; neither did it ever get involved in continent-wide conflicts. Strictly speaking, it was the largest business establishment in all of Stellarsky! However, its target customers were highly skilled martial artists and children from rich and powerful families. If one wished to enter the Martial Arts Hall without a level of power in the Purple Mansion Realm, he or she had to pay an entrance fee of a tael of purple gold.

source: 武殿是个很神奇的存在，没有人知道是谁建立的，什么时候建立的，武殿的人也一直很低调，只要不招惹武殿他们从不主动找事，更不参与六国纷争。
en_us: The Martial Arts Hall had a very mysterious existence - no one knew who built it, nor when it was built. The people of the Martial Arts Hall had also always been maintaining a low-profile. So long as no one triggered the ire of the Martial Arts Hall, its people would never actively cause trouble, nor would they ever get involved in six-nation world conflicts.

source: 武殿殿主来转了一圈，算是彻底断绝了杨管事和费老想培养江逸的心思，不过倒是确定江逸的确有一种神奇的能力，能帮武者快速提升武技熟练度。
en_us: The Master of the Martial Arts Hall's supervisory walkabout could be considered to have completely severed Manager Yang and Elder Fei's hopes of grooming and training Jiang Yi. However, he actually confirmed that Jiang Yi did indeed possess a mysterious power, capable of helping martial artists rapidly increase their proficiency level in martial arts techniques.

source: 武殿练功房一个小房间内，江逸结束了一轮修炼，睁开眼睛满脸复杂的感慨道。封印有一万八千枚，现在仅仅才消融四百枚，修炼速度就增幅如此之大，他都不敢想象等封印全部破解会何等的逆天。
en_us: Jiang Yi opened his eyes and mused after a round of cultivation in his tiny room in the Technique Practising Room. There were altogether eighteen thousand runic patterns on the seal, and his cultivation speed had already increased so drastically with just four hundred of them broken. He could hardly wrap his mind around how unnaturally powerful he would be when all of the runic patterns were broken.

source: 武殿虽然不属于城主府管，但姬家在天羽城是土皇帝，杨管事自然不敢得罪姬听雨，江逸也只能苦笑着快步跟随姬听雨进了一个练功房内。
en_us: Although the Martial Arts Hall was not under the administrative purview of the city administration, as the Ji Family was effectively the local lords of the land, Manager Yang naturally did not dare to offend Ji Tingyu. As such, Jiang Yi could only smile bitterly as he followed Ji Tingyu at a quick pace into one of the Technique Practising Rooms.

source: 武殿！
en_us: The Martial Arts Hall!

source: 武者境界的提升，元力会更一步凝练，威力增加！这是大陆人人皆知的常识，他实力达到铸鼎境二重，蓝色元力变幻这很正常，为何这黑色元力也会微微变色，还是颜色变浅？
en_us: As the powers of a martial artist increased in their stages in the Cast Tripod Realm, the essence forces he produced would become even more condensed, and its power would increase greatly! This was common knowledge amongst the people of Stellarsky Continent. It was normal that, with his power reaching the second stage of the Cast Tripod Realm, the properties of his blue essence force would fluctuate. Yet, why was it that that black essence force would experience a slight change in its colours as well - and on top of that, why did the colour become more light?

source: 武者感悟武技，要看悟性和苦练，一般只要悟性足够，任何一门武技大成都是时间问题。如果悟性不够，凭借苦练一辈子都可能达不到精通的地步。在这练功房内，封印了元力，全凭肉体力量和武技对敌，对于武技的掌握程度是有一定的帮助，但绝不可能随便和他对练几场就能大成。
en_us: The mastery of martial art techniques depended on a martial artist's raw talent and

source: 殿内整整安静了五分钟，满个屋里只有某鬼眼泪掉地的声音，啪答啪答又啪答……
en_us: The hall remained silent for five minutes, and the entire place was filled with the sounds of tears dripped onto the ground by some ghost: pitter-patter, pitter-patter…

source: 殿内顿时多了一道身影，他看起来极为年轻，身着蓝底白衣的长衫，手持一根玉笛，肩披墨发，面如冠玉，浑身却散发着一股清灵之气，仿佛天上不染尘的仙人，下一刻便会羽化而去。
en_us: A figure had suddenly appeared in the hall. He looked extremely young, clad in a long, white gown over a blue outfit, and held a jade flute in his hands. Sporting shoulder-length hair, he had a handsome face and his whole body exuded an aura of Spirit Cleansing Qi. He seemed like an immortal untouched by earthly concerns; one got the impression that he would ascend into heaven the very next moment.

source: 每一只沈萤都要问他一次，然后再拒绝，然后灵主再把灵兽扔掉。
en_us: Each time Shen Ying asked him if he knew how to cook meat, he said no and the Spirit Master would release the beast.

source: 每次化丹柳长老都亲自动手的，用强大火红色元力，把里面的药汁分化融炼成丹药。他看到柳长老如此强大实力炼制一炉丹都满头大汗的，他这点实力暂时想都别想了……
en_us: Every time they reached the second step, Elder Liu took up the mantle himself to form the elixirs, by using powerful fiery-red essence force to melt down and process the medicinal juices in the cauldron into elixirs. Seeing Elder Liu, with his immensely strong power, produce buckets of sweat on his head as he refined a cauldron of elixirs, Jiang Yi realized he should temporarily forget about doing the same with what little power he had...

source: 每次门派大比，都是上青界最热闹的盛事，比赛其实只用比三天，今天是初赛，主要是选出每个境界的前五十名。比赛方式也简单，每个境界分一百人一组，站到最后的就晋及。
en_us: Inter-sect competitions were grand events that attracted huge crowds in the Upper Azure World, but the entire competition actually only needed three days to finish. Today was the preliminary rounds which mainly served to select the top 50 in each cultivation divisions. The rules were also simple: each division would be divided into teams of 100 people and those who made it through this round would automatically qualify for the next round.

source: 每砸一下，鬼王身上的鬼气就散去一分，身形也薄一厘。原本山高一样的鬼影，此时已经小了三分之一了。之前还震耳欲聋的鬼叫，现在只余气音了。
en_us: Every time she smashed the ghost, the Ghost King's Qi dissipated a little and he became a little thinner. The giant Ghost King was now only a third of his original size. The deafening ghostly scream of before was reduced to a mere whisper.

source: 比如当江逸修炼水系功法江水决时，产生的元力是蓝色的，而他以前修炼也曾修炼过火系的烈焰决，那套功法产生的元力则是红色的。
en_us: For instance, when Jiang Yi practiced channeling water-element abilities through the Jiang Water Art, the essence force produced was blue; as for the Wildfire Art he had practiced when he was younger, the essence force produced was red.

source: 比如江逸修炼的江水决，就是人阶上品，比如他在江家学会的最高等级的武技“幻影拳”也是人阶上品的。
en_us: For instance, the Jiang Water Art practiced by Jiang Yi was classified as Man-tier superior grade; the highest level martial art technique "Phantom Fist" that he had learned from the Jiang Clan was also classified as Man-tier superior grade.

source: 比如江逸目前是铸鼎境一重，大致拥有一马之力，可开一石之弓，约等同于四钧一百二十斤力气。而身为铸鼎境二重的江豹呢，则大致拥有两马之力，也就是八均二百四十斤力气。
en_us: An average person at the first stage of the Cast Tripod Realm usually had the power of a horse. They could break a rock with a single blow and could lift 72 kilograms. Jiang Bao, a second-stage Cast Tripod Realm martial artist, had the power of two horses and could lift 144 kilograms.

source: 比起其它门派或多或少都站了七八个门人撑场面，这个门派显得格外寒酸，那里只站着三个修士，右侧竖起一面旗帜，上面写了两个字：无敌！
en_us: Compared to the other sects which each had seven to eight people in front of their stands, this sect looked cold and empty. There were only three cultivators there. Their flag was being held up by someone on the extreme right and had one word written on it: Invincible!

source: 比起在外面看来，整个山峰的灵气越加的浓郁，隐隐还能看到山顶之上浮着一宫殿。
en_us: Compared to what could be sensed from the outside, the Spirit Qi of the whole mountain was much denser, and they could faintly see a palace floating above the mountain.

source: 毕浩一停，却突然抱着右手跪了下去，张口喷出大口的血，喷了满地，整个右手正以诡异的角度垂在地上。
en_us: Bi Hao stopped, and suddenly squatted down hugging his right arm. He spewed mouthfuls of blood on the ground as his right arm hung at an awkward angle to the ground.

source: 毕浩快步朝这边走了过来，眼神肆无忌惮的扫过她的身体，里面的贪婪与欲望快要溢出来，“无常魔尊放心，毕浩可不似那些仙修，没有什么采补完，还将人送与他人玩弄的习惯。从今日起你只需服待我兄弟二人就可以了。”说着，伸手就朝着她胸口伸了过去。
en_us: Bi Hao quickly walked over. He scanned her body with no discretion, lust and greed apparent in his eyes. "Fiend Supremacy Impermanence, do not worry. Bi Hao is not like the other immortal cultivators, not completing the harvest and allowing others to play around with you. From today onwards, you only need to serve my brother and I." His hand then stretched towards her breasts.

source: 毛团一愣，似是被惊住了一样，怔怔的看着她，半会又低下头看着她的手，半天没反应过来。
en_us: The furball hesitated. It looked frightened for a second as it continued to stare at Shen Ying. Then, it looked down at her hand. It did not respond.

source: 毛团也不再反抗，反而顺从朝她靠近了一步，有意无意的把身子蹭向她的掌心。挺自觉啊，沈萤摸得更加欢畅了，从头到尾都撸了一把，一边摸还一边捏了捏它的肌肉。
en_us: The furball lost all of its earlier defensiveness. It obediently walked toward Shen Ying and intentionally - or unintentionally - leaned in toward her palm. It's quite self-conscious, Shen Ying carressed it more joyfully. She combed its fur from its head to its tail, feeling up its muscles.

source: 毛团眼睛睁得大大的，死死的盯着她的手，低吼得更加明显。沈萤心情很好的再次伸手过去，直接落在它巨大的头上，顺着头上的毛又摸了一把。
en_us: The furball's eyes grew even wider as it glared at Shen Ying's hand. Its growl became louder. Shen Ying once again happily reached out towawrd the beast and patted its head. Then, she began to comb the fur on the beast's head, following the flow of its fur from the top of its head to its neck.

source: 毫无动静。
en_us: No movement.

source: 求你了，祖宗！能不能放过这个秘境？
en_us: Please, Patriarch! Could you let this mystic realm off?

source: 江云海曾经说过，他可以去找他父亲相认，不过以后就两人将不再见面。对于他来说江云海比那个所谓的父亲重要多了，而且他父亲当年还抛弃了他母亲，这才导致他母亲含恨死去，所以对于这个父亲，他没有半点好感，反而都是恨意，刻骨铭心的恨！
en_us: Jiang Yunhai mentioned before that he could look for his father, but in the future, he would not be able to meet Jiang Yunhai anymore. To Jiang Yi, Jiang Yunhai is much more important than his so-called father. Furthermore, his father had abandoned his mother back then, which caused his mother to die out of grief. Hence he did not have a tinge of approval or liking for this kind of father, instead, he only had hatred. Hatred from the bottom of his heart.

source: 江云海透露的信息不多，但是每一句话和此刻钱万贯的情报对照起来，都无比的契合。
en_us: Jiang Yunhai had not revealed much, but every word and sentence he mentioned all matches the information he was hearing now perfectly.

source: 江如虎一直在偷偷观察情况，看到江如狼也被击飞后再也不敢看了，身子一缩偷偷朝侧门溜去，江如龙还没来，他还不跑下场唯有和地上江豹江松一样了。
en_us: Jiang Ruhu had been observing the situation all this time. After seeing Jiang Rulang got blasted off, he didn't dare continue watching anymore. He shrank his body and stealthily slipped towards the side door. Jiang Rulong had yet to arrive, if he still didn't escape, he would end up in the same state as Jiang Bao and Jiang Song on the floor.

source: 江如虎不是蠢货，否则也不会成为这群人的老大了，他嘴角露出一抹意味深长的微笑，快速和一名铸鼎境三重旁系子弟江如鹰对视一眼，给他打了一个眼色，这才转头和江逸点头道：“那是自然，我江如虎的话一言九鼎，你只要从我们胯下逐一爬过，保证以后见我们绕道而行，我就放你一马。如鹰，摆马步吧！”
en_us: Jiang Ruhu was no idiot - otherwise, how could he have possibly become the leader of this group of men? From the corner of his mouth came a faint smile filled with profound hidden meanings and intentions. He quickly turned to exchange glances with collateral descendant Jiang Ruying, whose power level was at the third stage of the Cast Tripod Realm. Only after giving Jiang Ruying a hidden signal with his eyes, did Jiang Ruhu turn his head and nodded at Jiang Yi, replying, "Naturally, I, Jiang Ruhu, speak words of enormous weight. So long as you crawl between all of our legs and under our groins, I will guarantee that the next time we cross paths, I will let you pass unharmed. Ruying, position yourself in the horse stance!"

source: 江如虎双眼失明，双手和一条腿被踢断，此刻感觉整个人飞了起来，被江逸抡起当做一根木棍般抡起乱扫，脑袋还两次从地面上擦过顿时气疯了，当着如此多小弟这么狼狈，他这个老大还怎么当？
en_us: Jiang Ruhu was blind in both eyes, had both his hands and legs broken by kicking; and worst of all, at that moment he could feel his entire body flying around as Jiang Yi swung him around in a random sweeping motion like a wooden stick, with his head even brushing past the ground twice. He immediately flew into a wild rage - how could he continue being a boss to all these familial subordinates, if he continued being in such a sorrt state in front so many of them?

source: 江如虎双眼暂时失明，眼中还一阵火辣如烈火灼烧，一听幻影拳心彻底沉了下来，本还想抵挡一下，此刻只能胡乱挥舞双臂在上方一阵乱砸了，护住脑袋。
en_us: Jiang Ruhu became temporarily blind in both his eyes; additionally, he felt a scorching sensation of agony burning like a raging inferno in his eyes. Upon hearing the incoming Phantom Punch attack, his heart sank completely. Initially he had thought of withstanding the attack; yet at that moment all he could do was to recklessly brandish both his arms and hitting the air above him in a random manner, in an effort to protect his own head.

source: 江如虎很快就冷笑起来，对着丹房大喝一声：“好，一言为定，十日之后，谁不去谁是孙子。”说完匆匆朝外面奔去，追赶已走了很远的江恨水而去。
en_us: Jiang Ruhu very quickly started laughing coldly. "Very well!" he shouted as he left. "A promise is a promise! Ten days later, whoever isn't there will be the other's grandchild!" Finishing his sentence, he hastily ran out of the building to catch up with Jiang Henshui who had already walked a long distance away.

source: 江如虎想死的心都有了，身体内剧烈的疼痛都让他麻木了，他的脑袋也晕了。这都不算什么，最让他感到屈辱的是，他一个大活人被人如此抡着，还是当着如此多人的面，又被抡了两次了，他以后算是彻底在江家抬不起头了。
en_us: Jiang Ruhu had already prepared to die, the intense pain within his body numbed his senses and his brain was in a dazed state of mind too. All those didn't matter, the thing he was most ashamed of, was to be whirled around like a human sack. This was the second time he got whirled in front of so many people. How would he still lift his head in the Jiang Clan?

source: 江如虎满脸横肉的脸却凑了过来，压低声音冷笑道：“哼，江逸！你有种一辈子永远在这炼丹房做缩头乌龟，你敢出江家大院，我保证让你爬着回来。”
en_us: Jiang Ruhu rushed over to him with a fierce look on his face, laughing coldly in a low voice as he said, "Hmph, Jiang Yi! If you have the guts, stay in this alchemy lab forever, you coward. If you ever dare to leave the central court, I will guarantee that you'll come back crawling."

source: 江如虎的声音断断续续的传来，众人满脸迷茫，这江如虎难道伤到脑袋了？自己都被打成这样了，还要帮江逸隐瞒？
en_us: Jiang Yi's voice stammered out in dribs and drabs. All had a perplexed look on their faces - could it be that Jiang Ruhu's brain was injured as well? He himself had already been beaten to such a pathetic state, yet how could it be that he still wanted to help hide Jiang Yi's secrets?

source: 江如虎看到江逸紧张得全身都绷紧起来，心里莫名感到一阵快意，如一群老虎戏耍一只猴子般有趣。他丹田内的元力悄然运转，一脸的横肉抖动起来，气势汹汹缓缓朝江逸走去，爆喝起来：“早知道怕，就别动我的人，现在……晚了！不过，虎爷我今日心情好就给你一个机会，只要你从我们所有人胯下爬过去，今日我们就放你一马，如何？”
en_us: Upon seeing Jiang Yi become so nervous that his entire body started becoming taut, Jiang Ruhu felt an indescribable burst of elation in his heart. It was so interesting, akin to a pack of tigers playing with a monkey. He quietly circulated the essence forces in his dantian as, with a fierce expression on his trembling face and an aggressive spirit surrounding him, he slowly walked toward Jiang Yi. He exploded in a loud shout, "Don't lay a finger on my men, if you knew you were going to be frightened about the consequences! Now... it's all too late! However, I, Master Hu, am in a good mood today so I'll give you one chance - we will let you off today, if you crawl between everyone's legs, under all of our groins. How about that?"

source: 江如虎臃肿的身子应声倒飞出去，重重的撞在三四丈外的一个小树上，又被反弹下来，在地上翻滚几圈。
en_us: Jiang Ruhu's obese body responded by flying backwards, crashing heavily into a small tree some thirty or fourty feet away, before recocheting off into the ground, leaving him rolling on the ground for several rounds.

source: 江如虎虽然天资一般，但有个江家大总管的好老子，修炼丹药从不缺，实力可是达到了铸鼎境四重，就算他动用黑色元力怕也很难战胜的。
en_us: Even though Jiang Ruhu's abilities were rather average, his dad was the Jiang Clan’s chief supervisor. Jiang Ruhu never lacked elixirs which could help boost his power up to the fourth stage of the Cast Tripod Realm. Even if Jiang Yi used his black essence force, he would still find it difficult to emerge victorious in a fight.

source: 江如虎被一口鲜血喷中，眼睛顿时睁不开了，他内心一沉，也不攻击了双手交叉护住头部，一边慌忙爆退，一边歇斯底里的大喊：“你们都是死人吗？还不快上？给我打死江逸这个野种！”
en_us: Jiang Ruhu was sprayed by a mouthful of fresh blood and as such, he could not immeidately open his eyes. His heart sank as he chose not to counter-attack but rather hold both his hands to protect his head. As he hurriedly retreated explosively backwards, he hysterically shouted, "Are you guys all dead? Why don't you hurry up and attack? Beat that bastard Jiang Yi to death for me!"

source: 江如虎被打得不成人样抬了回来，引起江家一片哗然，不过听说是马家子弟动的手全都不在意了，反而暗骂江如虎等人废物，丢江家的脸。
en_us: The physically mutilated state that Jiang Ruhu was left in after the fight and in which he had been carried home, triggered an uproar from the rest of the Jiang Clan. However, upon hearing that the injuries were the handiwork of Ma Family members, all the Jiang Clan members stopped minding about the injuries; instead, they secretly scolded Jiang Ruhu and his gang of Jiang Clan descendants for being useless good-for-nothings and losing face for the Jiang Clan.

source: 江如虎要的就是这个效果，如此多人江逸就算再逆天也双拳难敌四手，退一万步说，有这么多人拖延时间，足够等到江如龙的到来。
en_us: This was exactly the result that Jiang Ruhu wanted. No matter how heaven defying Jiang Yi was, he still wouldn't be able to go against that many people. In other words, it also meant that with so many of them stalling for time, Jiang Rulong would definitely be able to arrive on time.

source: 江如虎身边的三人立即惊醒，一直以来他们习惯了听从江如虎的命令，此刻也没有过多的犹豫，元力疯狂运转朝江逸冲去。
en_us: The three people standing next to Jiang Ruhu immediately roused from their stunned condition. They had always been used to obeying Jiang Ruhu's orders; likewise, at that moment they did not hestitate too much, and instead rushed towards Jiang Yi with essence force being circulated like crazy on them.

source: 江如虎那群人也全部懵了，两个多月前在西山，江逸才是铸鼎境二重吧？如此短的时间，他难道吞服了天阶丹药？想到两个多月前，江逸凭借铸鼎境二重都能把他揍得不成人样，江如虎下意识退后了两步。
en_us: Jiang Ruhu and the group all got a stun. Two months ago at the Western Hills, Jiang Yi was just at the second stage of the Cast Tripod Realm right? Such a large progress in such a short amount of time... Could he have consumed a heaven-tier elixir? Thinking back when Jiang Yi was just second stage of the Cast Tripod Realm, he was already beaten into pulp. Jiang Ruhu couldn't help but took two steps back unconsciously.

source: 江如虎！
en_us: Jiang Ruhu!

source: 江如鹰却很快醒悟过来，厉声大喝道：“江逸实力进步如此大，要是给家族知道了，非但不会责怪他，反而会重视他！还说不定会赐予核心子弟的身份，到时候我们就只能一辈子被他欺压了，这仇也没办法报了。虎哥说的没错，这事我们全部要隐瞒下来，就说和马家子弟开战，反正也不是第一次了，等龙哥从武殿内回来，再让龙哥出手……做了江逸！”
en_us: Yet Jiang Ruying very quickly connected the dots. In a stern voice, he shouted aloud, "Jiang Yi's power has improved so greatly - if the Family found out, not only would they not scold him, they might even see him as someone valuable! On top of that, they might even offer him the position as a core descendant of the Family! By that time, we would have no other option but be pushed around and be bullied by him forever, and we would never be able to get revenge for this. What Brother Hu said is right - we would have to keep this whole event as a secret, and say that we have a fight with the sons of the Ma Family. It's not the first time that has happened, after all. We will wait for Brother Long to return from the Martial Arts Hall, and then we will let Brother Long take action... and punish Jiang Yi for his actions!"

source: 江如鹰的身子重重砸落在地，右腿上裤子全部炸裂，满是鲜血的小腿上，森森白骨隐约可见，他整张脸都扭曲了，一股撕心裂肺的痛苦让他抱着右腿长嚎不休。
en_us: Jiang Ruying's body crashed heavily on the ground. His right pants leg had been completely torn to shreds in the explosion. The eerie pale white colour of bone could be vaguely seen on his lower right leg, itself covered in fresh blood. His entire face was distorted in a grimace, as an intensely acute pain radiating from his right leg left him cradling the leg and bawling ceaselessly.

source: 江如鹰眸子一转，快速和众人交代起来对上口供，避免回去之后被发现破绽。众人一边低声交谈，一边快速下了西山朝江家大院奔去。
en_us: Jiang Ruying shifted his pupils as he quickly instructed all the people around him by corroborating through the same matching testimony, to avoid discovering any mistakes or gaps in the story after they return home. While the group of men discussed in a low voice, they hastily left the Western Hills and ran towards the Jiang Residence Central Courtyard.

source: 江如龙不愧是江家年轻一代第二人，如果危险的关头，他单手抓住江如虎一甩，然后单腿在地上一点，身子横跃而起，另外一条腿化作残影朝江逸扫去。
en_us: Jiang Rulong was indeed worthy to be the no.2 of the Jiang Clan's young generation. At this critical moment, he used one hand to grab Jiang Ruhu and tossed him aside, then found his center of gravity by stepping on the ground with a single leg. He leaped back up and kicked at Jiang Yi with his other leg, leaving behind an afterimage.

source: 江如龙吓坏了，身子本来朝一边躲去的，连忙强行扭转身体，如炮弹般朝江如虎射去，最终在江如虎撞到墙壁前硬生生的抓住了他的身体。
en_us: Jiang Rulong got a scare, his body was actually meant to dodge to the side but he managed to twist his body and shot towards Jiang Ruhu like a cannon. He finally caught hold of Jiang Ruhu in time, right before Jiang Ruhu crashed into the wall.

source: 江如龙是铸鼎境七重，如果他能在江如龙出武殿之前，把境界提升到铸鼎境三重到四重，那么未必不可以和他一战了。
en_us: Jiang Rulong had a power level at the seventh stage of the Cast Tripod Realm. If he could increase his power-level up to the third or even fourth stage of the Cast Tripod Realm before Jiang Rulong left the Martial Arts Hall, it was not unlikely that he could fight with Jiang Rulong on a relatively-equal footing.

source: 江如龙暴怒的大吼，脑袋内传来的剧痛，鲜血浸入他的眼睛让他整个人都陷入癫狂之中。他不断的扭曲身子，不断的暴怒大吼，另外一条腿胡乱的乱踢，企图击中江逸，摆脱他的控制。
en_us: Jiang Rulong roared furiously. The intense pain that came from within his head, the blood that soaked his eyes caused him to going into a frenzied state of mind. He continually contorted his body and roared furiously, his other leg randomly kicked in attempt to hit Jiang Yi and rid of his grasp.
